; domain
(define (domain liftedtcore_blocksworld-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :action-costs)
 (:types block)
 (:constants
   purple_block_1 black_block_1 purple_block_2 brown_block_1 yellow_block_1 - block
 )
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block) (hold_0) (seen_psi_1) (hold_2) (hold_3) (hold_4) (hold_5) (hold_6) (hold_7))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty) (or (not (and (ontable black_block_1) (not (= ?obj black_block_1)))) (seen_psi_1)))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (when (and (ontable black_block_1) (not (= ?obj black_block_1))) (hold_0)) (when (or (not (and (clear yellow_block_1) (not (= ?obj yellow_block_1)))) (not (and (ontable brown_block_1) (not (= ?obj brown_block_1))))) (seen_psi_1)) (when (or (= ?obj brown_block_1) (holding brown_block_1)) (hold_3)) (when (not (and (ontable yellow_block_1) (not (= ?obj yellow_block_1)))) (hold_4)) (when (and (not (and (ontable yellow_block_1) (not (= ?obj yellow_block_1)))) (not (or (on brown_block_1 purple_block_2) (and (ontable yellow_block_1) (not (= ?obj yellow_block_1)))))) (not (hold_5))) (when (or (on brown_block_1 purple_block_2) (and (ontable yellow_block_1) (not (= ?obj yellow_block_1)))) (hold_5)) (when (and (not (on brown_block_1 purple_block_1)) (not (or (= ?obj yellow_block_1) (holding yellow_block_1)))) (not (hold_7))) (when (or (= ?obj yellow_block_1) (holding yellow_block_1)) (hold_7)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj) (or (not (or (= ?obj black_block_1) (ontable black_block_1))) (seen_psi_1)))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (when (or (= ?obj black_block_1) (ontable black_block_1)) (hold_0)) (when (or (not (or (= ?obj yellow_block_1) (clear yellow_block_1))) (not (or (= ?obj brown_block_1) (ontable brown_block_1)))) (seen_psi_1)) (when (and (holding brown_block_1) (not (= ?obj brown_block_1))) (hold_3)) (when (not (or (= ?obj yellow_block_1) (ontable yellow_block_1))) (hold_4)) (when (and (not (or (= ?obj yellow_block_1) (ontable yellow_block_1))) (not (or (on brown_block_1 purple_block_2) (= ?obj yellow_block_1) (ontable yellow_block_1)))) (not (hold_5))) (when (or (on brown_block_1 purple_block_2) (= ?obj yellow_block_1) (ontable yellow_block_1)) (hold_5)) (when (and (not (on brown_block_1 purple_block_1)) (not (and (holding yellow_block_1) (not (= ?obj yellow_block_1))))) (not (hold_7))) (when (and (holding yellow_block_1) (not (= ?obj yellow_block_1))) (hold_7)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (when (or (not (or (= ?obj yellow_block_1) (and (clear yellow_block_1) (not (= ?underobj yellow_block_1))))) (not (ontable brown_block_1))) (seen_psi_1)) (when (or (and (= ?obj purple_block_2) (= ?underobj black_block_1)) (on purple_block_2 black_block_1)) (hold_2)) (when (and (holding brown_block_1) (not (= ?obj brown_block_1))) (hold_3)) (when (and (not (ontable yellow_block_1)) (not (or (and (= ?obj brown_block_1) (= ?underobj purple_block_2)) (on brown_block_1 purple_block_2) (ontable yellow_block_1)))) (not (hold_5))) (when (or (and (= ?obj brown_block_1) (= ?underobj purple_block_2)) (on brown_block_1 purple_block_2) (ontable yellow_block_1)) (hold_5)) (when (not (or (and (= ?obj brown_block_1) (= ?underobj purple_block_1)) (on brown_block_1 purple_block_1))) (hold_6)) (when (and (not (or (and (= ?obj brown_block_1) (= ?underobj purple_block_1)) (on brown_block_1 purple_block_1))) (not (and (holding yellow_block_1) (not (= ?obj yellow_block_1))))) (not (hold_7))) (when (and (holding yellow_block_1) (not (= ?obj yellow_block_1))) (hold_7)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (when (or (not (or (= ?underobj yellow_block_1) (and (clear yellow_block_1) (not (= ?obj yellow_block_1))))) (not (ontable brown_block_1))) (seen_psi_1)) (when (and (on purple_block_2 black_block_1) (not (and (= ?obj purple_block_2) (= ?underobj black_block_1)))) (hold_2)) (when (or (= ?obj brown_block_1) (holding brown_block_1)) (hold_3)) (when (and (not (ontable yellow_block_1)) (not (or (and (on brown_block_1 purple_block_2) (not (and (= ?obj brown_block_1) (= ?underobj purple_block_2)))) (ontable yellow_block_1)))) (not (hold_5))) (when (or (and (on brown_block_1 purple_block_2) (not (and (= ?obj brown_block_1) (= ?underobj purple_block_2)))) (ontable yellow_block_1)) (hold_5)) (when (not (and (on brown_block_1 purple_block_1) (not (and (= ?obj brown_block_1) (= ?underobj purple_block_1))))) (hold_6)) (when (and (not (and (on brown_block_1 purple_block_1) (not (and (= ?obj brown_block_1) (= ?underobj purple_block_1))))) (not (or (= ?obj yellow_block_1) (holding yellow_block_1)))) (not (hold_7))) (when (or (= ?obj yellow_block_1) (holding yellow_block_1)) (hold_7)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_blocksworld-problem)
 (:domain liftedtcore_blocksworld-domain)
 (:objects
 )
 (:init (ontable purple_block_1) (ontable brown_block_1) (on yellow_block_1 brown_block_1) (on purple_block_2 purple_block_1) (on black_block_1 purple_block_2) (clear yellow_block_1) (clear black_block_1) (handempty) (hold_4) (hold_6) (= (total-cost) 0))
 (:goal (and (clear purple_block_1) (hold_0) (hold_2) (hold_3) (hold_4) (hold_5) (hold_6) (hold_7)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack yellow_block_1 brown_block_1)
   deleted: (on yellow_block_1 brown_block_1) (clear yellow_block_1) (handempty)
   added: (holding yellow_block_1) (clear brown_block_1) (seen_psi_1) (hold_7)
   goals met: 3 of 8
2. (putdown yellow_block_1)
   deleted: (holding yellow_block_1) (hold_7)
   added: (clear yellow_block_1) (handempty) (ontable yellow_block_1) (hold_5)
   goals met: 3 of 8
3. (unstack black_block_1 purple_block_2)
   deleted: (on black_block_1 purple_block_2) (clear black_block_1) (handempty)
   added: (holding black_block_1) (clear purple_block_2)
   goals met: 3 of 8
4. (putdown black_block_1)
   deleted: (holding black_block_1)
   added: (clear black_block_1) (handempty) (ontable black_block_1) (hold_0)
   goals met: 4 of 8
5. (unstack purple_block_2 purple_block_1)
   deleted: (on purple_block_2 purple_block_1) (clear purple_block_2) (handempty)
   added: (holding purple_block_2) (clear purple_block_1)
   goals met: 5 of 8
6. (stack purple_block_2 black_block_1)
   deleted: (clear black_block_1) (holding purple_block_2)
   added: (handempty) (clear purple_block_2) (on purple_block_2 black_block_1) (hold_2)
   goals met: 6 of 8
7. (pickup brown_block_1)
   deleted: (clear brown_block_1) (ontable brown_block_1) (handempty)
   added: (holding brown_block_1) (hold_3)
   goals met: 7 of 8
8. (stack brown_block_1 purple_block_2)
   deleted: (clear purple_block_2) (holding brown_block_1)
   added: (handempty) (clear brown_block_1) (on brown_block_1 purple_block_2)
   goals met: 7 of 8
9. (pickup yellow_block_1)
   deleted: (clear yellow_block_1) (ontable yellow_block_1) (handempty)
   added: (holding yellow_block_1) (hold_7)
   goals met: 8 of 8
